import fs from "fs"
let handler = m => m
 handler.all = async function (m, { conn, command, text }) {
    let chat = global.db.data.chats[m.chat]
   
 let x = `${pickRandom([ 'سي سي','لولوش' ,'نير','ميسا', 'ال','لايت' ,'غون','كيلوا' , 'ليوريو','هيسوكا' ,'كورابيكا','الوكا' ,'جين' , 'فريكس','اشيلاد' ,'ثورفين' , 'استا' ,'سيبر','كوشينا' ,'ميناتو','تيماري' , 'شيكامارو','باين' ,'ايتاتشي' , 'ريم','رين','شيسوي' ,'كاكاشي','اوبيتو', 'مادارا','باور' ,'غاي','ساكورا' ,'هيناتا', 'ساسكي' ,'ناروتو' ,'اسونا','كيريتو' ,'يوتا','نانامي', 'سوكونا','يوجي', 'نوبارا','ميغومي' ,'غوجو','زينو' ,'هاك','يونا' ,'تينغن','رينغوكو', 'توكيتو','كوكوشيبو' ,'يوريتشي','ميتسوري' ,'سانيمي','اوباناي', 'شينوبو','غيو' ,'كاناو','ريمورو' ,'ماغنا','نويل','يامي', 'يونو','فينرال', 'شوتو','باكوغو' ,'ديكو','ديابلو' ,'دابي','توغا', 'تانجيرو','نيزوكو' ,'زينيتسو','اينوسكي', 'دوما','اكازا', 'موزان','كيم','روبين','هانكوك', 'اشيلاد','مادارا','لوفي','نامي', 'اوسوب','شانكس','غيو','ميكو', 'نيزوكو','ساسكي','ناروتو', 'ميكاسا','ايرين','ايروين', 'ثورفين','ثوركيل','شيكي','كايدو','ارمين','جاك','تانجيرو','ريفانا','ميليوداس','كينغ','غوثر', 'إسكانور','مارلين','يونو','استا','يامي','يوسارين','ميكامي','شيكيموري','ادوارد','ال','لايت','نانامي', 'كوروكو','ياغامي','كيرا','اشيتو','ايساغي','روي','تيماري','ساكورا','اينو','ايتشيغو','اوراهارا','ايزن','ياماتو','رينغوكو','اينوسكي','كو','فوتابا','رين','ريوسي','غوجو','يوجي','سوكونا','ريفي','فيفي','زورو','سانجي','فرانكي','انيا', 'يور','اودين','لويد','ليفاي','زيك','ماي','ماري','توكا','كانيكي','سوبارو','سيسي','شين','غون','غاي','هانجي','سایا',
                  
                       ])}`

let l = Math.floor(Math.random() * x.length);

let top = `*${x}*`

if (/^كت$/i.test(m.text) && !chat.isBanned) {

    m.reply(top, null)}}
export default handler
function pickRandom(list) {
return list[Math.floor(Math.random() * list.length)]}